awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/CMSIS/SVD/PY32F090xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DBG</name>
      <baseAddress>0x40015800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IDCODE</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>REV_ID</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>DBG_SLEEP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DBG_STOP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DBG_STDBY</name>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_FZ1</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DBG_TIM2_STOP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DBG_TIM3_STOP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DBG_TIM6_STOP</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DBG_TIM7_STOP</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DBG_RTC_STOP</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DBG_WWDG_STOP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DBG_IWDG_STOP</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DBG_STOP</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>DBG_I2C1_STOP</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>DBG_I2C2_STOP</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>DBG_LPTIM2_STOP</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>DBG_LPTIM1_STOP</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_FZ2</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DBG_TIM1_STOP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DBG_TIM15_STOP</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>DBG_TIM16_STOP</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>DBG_TIM17_STOP</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DBG_PWM_STOP</name>
              <bitRange>[19:19]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>Direct memory access</description>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA1_Channel1</name>
        <description>DMA1 Channel 1 Interrupt</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>DMA1_Channel2_3</name>
        <description>DMA1 Channel 2 and Channel 3 Interrupt</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>DMA1_Channel4_5_6_7</name>
        <description>DMA1 Channel 4, 5, 6, 7 Interrupts</description>
        <value>11</value>
      </interrupt>
      <registers>
        <register>
          <name>ISR</name>
          <description>desc ISR</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>TCIF1</name>
              <description>Transfer Complete Flag for Channel 1</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BTCIF1</name>
              <description>Block Transfer Complete Flag for Channel 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HBTIF1</name>
              <description>Half Block Transfer Complete Flag for Channel 1</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF1</name>
              <description>Transfer Error Flag for Channel 1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF2</name>
              <description>Transfer Complete Flag for Channel 2</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BTCIF2</name>
              <description>Block Transfer Complete Flag for Channel 2</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HBTIF2</name>
              <description>Half Block Transfer Complete Flag for Channel 2</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF2</name>
              <description>Transfer Error Flag for Channel 2</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF3</name>
              <description>Transfer Complete Flag for Channel 3</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BTCIF3</name>
              <description>Block Transfer Complete Flag for Channel 3</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HBTIF3</name>
              <description>Half Block Transfer Complete Flag for Channel 3</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF3</name>
              <description>Transfer Error Flag for Channel 3</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF4</name>
              <description>Transfer Complete Flag for Channel 4</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BTCIF4</name>
              <description>Block Transfer Complete Flag for Channel 4</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HBTIF4</name>
              <description>Half Block Transfer Complete Flag for Channel 4</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF4</name>
              <description>Transfer Error Flag for Channel 4</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF5</name>
              <description>Transfer Complete Flag for Channel 5</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BTCIF5</name>
              <description>Block Transfer Complete Flag for Channel 5</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HBTIF5</name>
              <description>Half Block Transfer Complete Flag for Channel 5</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF5</name>
              <description>Transfer Error Flag for Channel 5</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF6</name>
              <description>Transfer Complete Flag for Channel 6</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BTCIF6</name>
              <description>Block Transfer Complete Flag for Channel 6</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HBTIF6</name>
              <description>Half Block Transfer Complete Flag for Channel 6</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF6</name>
              <description>Transfer Error Flag for Channel 6</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF7</name>
              <description>Transfer Complete Flag for Channel 7</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BTCIF7</name>
              <description>Block Transfer Complete Flag for Channel 7</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HBTIF7</name>
              <description>Half Block Transfer Complete Flag for Channel 7</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF7</name>
              <description>Transfer Error Flag for Channel 7</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFCR</name>
          <description>desc IFCR</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>CTCIF1</name>
              <description>Transfer Complete Flag Clear for Channel 1</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CBTCIF1</name>
              <description>Block Transfer Complete Flag Clear for Channel 1</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CHBTIF1</name>
              <description>Half Block Transfer Complete Flag Clear for Channel 1</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTEIF1</name>
              <description>Transfer Error Flag Clear for Channel 1</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTCIF2</name>
              <description>Transfer Complete Flag Clear for Channel 2</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CBTCIF2</name>
              <description>Block Transfer Complete Flag Clear for Channel 2</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CHBTIF2</name>
              <description>Half Block Transfer Complete Flag Clear for Channel 2</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTEIF2</name>
              <description>Transfer Error Flag Clear for Channel 2</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTCIF3</name>
              <description>Transfer Complete Flag Clear for Channel 3</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CBTCIF3</name>
              <description>Block Transfer Complete Flag Clear for Channel 3</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CHBTIF3</name>
              <description>Half Block Transfer Complete Flag Clear for Channel 3</description>
              <bitRange>[10:10]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTEIF3</name>
              <description>Transfer Error Flag Clear for Channel 3</description>
              <bitRange>[11:11]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTCIF4</name>
              <description>Transfer Complete Flag Clear for Channel 4</description>
              <bitRange>[12:12]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CBTCIF4</name>
              <description>Block Transfer Complete Flag Clear for Channel 4</description>
              <bitRange>[13:13]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CHBTIF4</name>
              <description>Half Block Transfer Complete Flag Clear for Channel 4</description>
              <bitRange>[14:14]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTEIF4</name>
              <description>Transfer Error Flag Clear for Channel 4</description>
              <bitRange>[15:15]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTCIF5</name>
              <description>Transfer Complete Flag Clear for Channel 5</description>
              <bitRange>[16:16]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CBTCIF5</name>
              <description>Block Transfer Complete Flag Clear for Channel 5</description>
              <bitRange>[17:17]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CHBTIF5</name>
              <description>Half Block Transfer Complete Flag Clear for Channel 5</description>
              <bitRange>[18:18]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTEIF5</name>
              <description>Transfer Error Flag Clear for Channel 5</description>
              <bitRange>[19:19]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTCIF6</name>
              <description>Transfer Complete Flag Clear for Channel 6</description>
              <bitRange>[20:20]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CBTCIF6</name>
              <description>Block Transfer Complete Flag Clear for Channel 6</description>
              <bitRange>[21:21]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CHBTIF6</name>
              <description>Half Block Transfer Complete Flag Clear for Channel 6</description>
              <bitRange>[22:22]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTEIF6</name>
              <description>Transfer Error Flag Clear for Channel 6</description>
              <bitRange>[23:23]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTCIF7</name>
              <description>Transfer Complete Flag Clear for Channel 7</description>
              <bitRange>[24:24]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CBTCIF7</name>
              <description>Block Transfer Complete Flag Clear for Channel 7</description>
              <bitRange>[25:25]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CHBTIF7</name>
              <description>Half Block Transfer Complete Flag Clear for Channel 7</description>
              <bitRange>[26:26]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTEIF7</name>
              <description>Transfer Error Flag Clear for Channel 7</description>
              <bitRange>[27:27]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <description>desc CCR1</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer Complete Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BTCIE</name>
              <description>Block Transfer Complete Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HBTIE</name>
              <description>Half Block Transfer Complete Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer Error Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>Data Transfer Direction</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <description>Circular Mode</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRANST</name>
              <description>Transfer Type</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <description>Peripheral Increment Mode</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <description>Memory Increment Mode</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Peripheral Size</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <description>Memory Size</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <description>Priority Level</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>Memory-to-memory Mode</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>PNORLD</name>
              <description>Peripheral No Reload</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>MNORLD</name>
              <description>Memory No Reload</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BTCSUSP</name>
              <description>Suspend in Block Transfer Complete Interrupt</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>M2MARB</name>
              <description>Memory-to-memory Mode Arbitration</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR1</name>
          <description>desc CNDTR1</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <description>Number of Data to Transfer</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR1</name>
          <description>desc CPAR1</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>Peripheral Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR1</name>
          <description>desc CMAR1</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCCFGR1</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>NBT</name>
              <description>Number of Block to Loop Transfer</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>NDTL</name>
              <description>Number of Data to Transfer Last Loop</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
