awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/CMSIS/SVD/PY32F090xx.svd
        <register>
          <name>BSRR</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>BS0</name>
              <description>GPIOD0 output set</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS1</name>
              <description>GPIOD1 output set</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS2</name>
              <description>GPIOD2 output set</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS3</name>
              <description>GPIOD3 output set</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS4</name>
              <description>GPIOD4 output set</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS5</name>
              <description>GPIOD5 output set</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS6</name>
              <description>GPIOD6 output set</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS7</name>
              <description>GPIOD7 output set</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS8</name>
              <description>GPIOD8 output set</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS9</name>
              <description>GPIOD9 output set</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS10</name>
              <description>GPIOD10 output set</description>
              <bitRange>[10:10]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS11</name>
              <description>GPIOD11 output set</description>
              <bitRange>[11:11]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS12</name>
              <description>GPIOD12 output set</description>
              <bitRange>[12:12]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS13</name>
              <description>GPIOD13 output set</description>
              <bitRange>[13:13]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS14</name>
              <description>GPIOD14 output set</description>
              <bitRange>[14:14]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BS15</name>
              <description>GPIOD15 output set</description>
              <bitRange>[15:15]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR0</name>
              <description>GPIOD0 outut reset</description>
              <bitRange>[16:16]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR1</name>
              <description>GPIOD1 outut reset</description>
              <bitRange>[17:17]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR2</name>
              <description>GPIOD2 outut reset</description>
              <bitRange>[18:18]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR3</name>
              <description>GPIOD3 outut reset</description>
              <bitRange>[19:19]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR4</name>
              <description>GPIOD4 outut reset</description>
              <bitRange>[20:20]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR5</name>
              <description>GPIOD5 outut reset</description>
              <bitRange>[21:21]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR6</name>
              <description>GPIOD6 outut reset</description>
              <bitRange>[22:22]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR7</name>
              <description>GPIOD7 outut reset</description>
              <bitRange>[23:23]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR8</name>
              <description>GPIOD8 outut reset</description>
              <bitRange>[24:24]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR9</name>
              <description>GPIOD9 outut reset</description>
              <bitRange>[25:25]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR10</name>
              <description>GPIOD10 outut reset</description>
              <bitRange>[26:26]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR11</name>
              <description>GPIOD11 outut reset</description>
              <bitRange>[27:27]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR12</name>
              <description>GPIOD12 outut reset</description>
              <bitRange>[28:28]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR13</name>
              <description>GPIOD13 outut reset</description>
              <bitRange>[29:29]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR14</name>
              <description>GPIOD14 outut reset</description>
              <bitRange>[30:30]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR15</name>
              <description>GPIOD15 outut reset</description>
              <bitRange>[31:31]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCKR</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>LCK0</name>
              <description>GPIOD lock(bit0)</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LCK1</name>
              <description>GPIOD lock(bit1)</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LCK2</name>
              <description>GPIOD lock(bit2)</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LCK3</name>
              <description>GPIOD lock(bit3)</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LCK4</name>
              <description>GPIOD lock(bit4)</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LCK5</name>
              <description>GPIOD lock(bit5)</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LCK6</name>
              <description>GPIOD lock(bit6)</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LCK7</name>
              <description>GPIOD lock(bit7)</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LCK8</name>
              <description>GPIOD lock(bit8)</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LCK9</name>
              <description>GPIOD lock(bit9)</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LCK10</name>
              <description>GPIOD lock(bit10)</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LCK11</name>
              <description>GPIOD lock(bit11)</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LCK12</name>
              <description>GPIOD lock(bit12)</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LCK13</name>
              <description>GPIOD lock(bit13)</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LCK14</name>
              <description>GPIOD lock(bit14)</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>LCK15</name>
              <description>GPIOD lock(bit15)</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>LCKK</name>
              <description>GPIOD lock key</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AFRL</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>AFSEL0</name>
              <description>GPIOD0 AF select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>AFSEL1</name>
              <description>GPIOD1 AF select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>AFSEL2</name>
              <description>GPIOD2 AF select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>AFSEL3</name>
              <description>GPIOD3 AF select</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>AFSEL4</name>
              <description>GPIOD4 AF select</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>AFSEL5</name>
              <description>GPIOD5 AF select</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>AFSEL6</name>
              <description>GPIOD6 AF select</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>AFSEL7</name>
              <description>GPIOD7 AF select</description>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AFRH</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>AFSEL8</name>
              <description>GPIOD8 AF select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>AFSEL9</name>
              <description>GPIOD9 AF select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>AFSEL10</name>
              <description>GPIOD10 AF select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>AFSEL11</name>
              <description>GPIOD11 AF select</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>AFSEL12</name>
              <description>GPIOD12 AF select</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>AFSEL13</name>
              <description>GPIOD13 AF select</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>AFSEL14</name>
              <description>GPIOD14 AF select</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>AFSEL15</name>
              <description>GPIOD15 AF select</description>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BRR</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>BR0</name>
              <description>GPIOD 0 output pin reset</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR1</name>
              <description>GPIOD 1 output pin reset</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR2</name>
              <description>GPIOD 2 output pin reset</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR3</name>
              <description>GPIOD 3 output pin reset</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR4</name>
              <description>GPIOD 4 output pin reset</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR5</name>
              <description>GPIOD 5 output pin reset</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR6</name>
              <description>GPIOD 6 output pin reset</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR7</name>
              <description>GPIOD 7 output pin reset</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR8</name>
              <description>GPIOD 8 output pin reset</description>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR9</name>
              <description>GPIOD 9 output pin reset</description>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR10</name>
              <description>GPIOD 10 output pin reset</description>
              <bitRange>[10:10]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR11</name>
              <description>GPIOD 11 output pin reset</description>
              <bitRange>[11:11]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR12</name>
              <description>GPIOD 12 output pin reset</description>
              <bitRange>[12:12]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR13</name>
              <description>GPIOD 13 output pin reset</description>
              <bitRange>[13:13]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR14</name>
              <description>GPIOD 14 output pin reset</description>
              <bitRange>[14:14]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BR15</name>
              <description>GPIOD 15 output pin reset</description>
              <bitRange>[15:15]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
