awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/CMSIS/SVD/PY32F090xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C2</name>
      <description>desc I2C</description>
      <baseAddress>0x40005800</baseAddress>
      <interrupt>
        <name>I2C2</name>
        <description>I2C2 Event Interrupt</description>
        <value>24</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>IWDG</name>
      <description>Independent watchdog</description>
      <baseAddress>0x40003000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>KR</name>
          <description>Key register (IWDG_KR)</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>KEY</name>
              <description>IWDG KEY</description>
              <bitRange>[15:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PR</name>
          <description>Prescaler register (IWDG_PR)</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>PR</name>
              <description>IWDG preload</description>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RLR</name>
          <description>Reload register (IWDG_RLR)</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>RL</name>
              <description>IWDG reload</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status register (IWDG_SR)</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>PVU</name>
              <description>Watchdog prescaler value update</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RVU</name>
              <description>Watchdog counter reload value update</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IVU</name>
              <description>Watchdog Interrupt value update</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IF</name>
              <description>Watchdog interrupt status</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICNTR</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>ICNTR</name>
              <description>Watchdog prescaler value update</description>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>IER</name>
              <description>Watchdog Interrupt enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ICR</name>
              <description>Watchdog interrupt status clear</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LCD</name>
      <description>LCD CONTROLLER</description>
      <baseAddress>0x40002400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>LCD</name>
        <description>LCD global Interrupt</description>
        <value>8</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LCDCLK</name>
              <bitRange>[2:1]</bitRange>
            </field>
            <field>
              <name>BIAS</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>DUTY</name>
              <bitRange>[8:6]</bitRange>
            </field>
            <field>
              <name>BSEL</name>
              <bitRange>[10:9]</bitRange>
            </field>
            <field>
              <name>CONTRAST</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>VSEL</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>VCP_SEL</name>
              <bitRange>[19:17]</bitRange>
            </field>
            <field>
              <name>FCCTL</name>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>DEAD</name>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>CP_FRQ</name>
              <bitRange>[29:27]</bitRange>
            </field>
            <field>
              <name>CP_ST</name>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>BLINKCNT</name>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>BLINKEN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SWCAP_DRV_NUM</name>
              <bitRange>[9:7]</bitRange>
            </field>
            <field>
              <name>MODE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DMAEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BKFIE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UDDIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>UDR</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>BKF</name>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SOF</name>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>UDD</name>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ENS</name>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCLR</name>
          <description>INTCLR</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>BKFC</name>
              <bitRange>[16:16]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SOFC</name>
              <bitRange>[17:17]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>UDDC</name>
              <bitRange>[18:18]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>POEN0</name>
          <description>POEN0</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>SX</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>POEN1</name>
          <description>POEN1</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>SX</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>SXCY</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>CX</name>
              <bitRange>[11:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM0</name>
          <description>des RAM0</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>DX</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM1</name>
          <description>des RAM1</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>DX</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM2</name>
          <description>des RAM2</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>DX</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM3</name>
          <description>des RAM3</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>DX</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM4</name>
          <description>des RAM4</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>DX</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM5</name>
          <description>des RAM5</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>DX</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM6</name>
          <description>des RAM6</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>DX</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM7</name>
          <description>des RAM7</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>DX</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM8</name>
          <description>des RAM8</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>DX</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM9</name>
          <description>des RAM9</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>DX</name>
              <bitRange>[7:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM10</name>
          <description>des RAM10</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>DX</name>
              <bitRange>[7:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM11</name>
          <description>des RAM11</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>DX</name>
              <bitRange>[7:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM12</name>
          <description>des RAM12</description>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>DX</name>
              <bitRange>[7:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM13</name>
          <description>des RAM13</description>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>DX</name>
              <bitRange>[7:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM14</name>
          <description>des RAM14</description>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>DX</name>
              <bitRange>[7:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAM15</name>
          <description>des RAM15</description>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>DX</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
