awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/CMSIS/SVD/PY32F090xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI2</name>
      <baseAddress>0x40003800</baseAddress>
      <interrupt>
        <name>SPI2</name>
        <description>SPI2 global Interrupt</description>
        <value>26</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <description>desc SYSCFG</description>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFGR1</name>
          <description>desc CFGR1</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>MEM_MODE</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>TK_LP_TRIG</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>RTC_TRIG_TKSEL</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>LPTIM1_TRIG_TKEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LPTIM2_TRIG_TKEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>GPIO_AHB_SEL</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <description>desc CFGR2</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>CLL</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SPL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>PVDL</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ECCL</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR3</name>
          <description>desc CFGR3</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DMA1_MAP</name>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>DMA2_MAP</name>
              <bitRange>[13:8]</bitRange>
            </field>
            <field>
              <name>DMA3_MAP</name>
              <bitRange>[21:16]</bitRange>
            </field>
            <field>
              <name>DMA4_MAP</name>
              <bitRange>[29:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_ENS_REG</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>PA_ENS</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB_ENS_REG</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>PB_ENS</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_ENS_REG</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>PC_ENS</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PD_ENS_REG</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>PD_ENS</name>
              <bitRange>[13:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IOCFG</name>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>PA_EIIC</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>PB_EIIC</name>
              <bitRange>[13:8]</bitRange>
            </field>
            <field>
              <name>PD_EIIC_10</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>PD_EIIC_11</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>PC_EIIC</name>
              <bitRange>[24:16]</bitRange>
            </field>
            <field>
              <name>PD_EIIC</name>
              <bitRange>[29:26]</bitRange>
            </field>
            <field>
              <name>PD_PU_IIC</name>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LEDCFG</name>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>SEGIS_EN</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>PB_EHS</name>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>PB_ENSEG</name>
              <bitRange>[29:16]</bitRange>
            </field>
            <field>
              <name>PC_ENSEG</name>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PA_ANA2EN</name>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>PA_ANA2EN</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB_ANA2EN</name>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>PB_ANA2EN</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_ANA2EN</name>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>PC_ANA2EN</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PD_ANA2EN</name>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>PD_ANA2EN</name>
              <bitRange>[13:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCSR</name>
          <addressOffset>0x70</addressOffset>
          <fields>
            <field>
              <name>PERR_RSTEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SPF</name>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SWPR</name>
          <addressOffset>0x74</addressOffset>
          <fields>
            <field>
              <name>SRAM_P0WP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SRAM_P1WP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SRAM_P2WP</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SRAM_P3WP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SRAM_P4WP</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SRAM_P5WP</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SRAM_P6WP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SRAM_P7WP</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SRAM_P8WP</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SRAM_P9WP</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SRAM_P10WP</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SRAM_P11WP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SRAM_P12WP</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SRAM_P13WP</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SRAM_P14WP</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SRAM_P15WP</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SRAM_P16WP</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SRAM_P17WP</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SRAM_P18WP</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>SRAM_P19WP</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SRAM_P20WP</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SRAM_P21WP</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>SRAM_P22WP</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>SRAM_P23WP</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>SRAM_P24WP</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SRAM_P25WP</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>SRAM_P26WP</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>SRAM_P27WP</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SRAM_P28WP</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>SRAM_P29WP</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>SRAM_P30WP</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>SRAM_P31WP</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
