awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/CMSIS/SVD/PY32F090xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIM16">
      <name>TIM17</name>
      <baseAddress>0x40014800</baseAddress>
      <interrupt>
        <name>TIM17</name>
        <description>TIM17 global Interrupt</description>
        <value>22</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>TK</name>
      <baseAddress>0x40012800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x110</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EXTCMODEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ICOPA</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COPAMODE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>COPADATA</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>VCC1SEL</name>
              <bitRange>[13:11]</bitRange>
            </field>
            <field>
              <name>MIDACSTEP</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SIDACSTEP</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CFT</name>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>INTCMODEN</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CMPHYSEN</name>
              <description>Comparetor Hysteresis Enable</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BUFFEREN</name>
              <description>Buffer Enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>DIV</name>
              <description>TK_CLK Division</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>STDIV</name>
              <description>ST_CLK Division</description>
              <bitRange>[30:27]</bitRange>
            </field>
            <field>
              <name>INTEREN</name>
              <description>Internal Enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>START</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RSTB</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SWCTRL</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMODCHRG</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CMODISCH</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>MIDACEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SIDACEN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>PWMM</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CTRLSOURCE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LPABNORMAL</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SHORTSW_NUM</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>LPEN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>KVREF</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>LFSRW</name>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>CMODCOPA</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CMODCS</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CMODEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDACR</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>MIDAC</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>SIDAC</name>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KR</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>KEN</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>CHS</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>UCR</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>COPAMODEIO</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>STR</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>SETTIME</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WR</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>WIN</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SDR</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>SWDIV</name>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSR</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>LFSRP</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>SEED</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>DATA</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>SENSEDONE</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CMPOUT</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SHORTSWERR</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>EVTINTEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ERRINTEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>EVTINTCLR</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ERRINTCLR</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CDR</name>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>CDATA</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LPDR</name>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>NORMALDELTA</name>
              <bitRange>[9:0]</bitRange>
            </field>
            <field>
              <name>ABNORMALDELTA</name>
              <bitRange>[25:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LPTR</name>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>LPWAIT</name>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OPR</name>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>OP</name>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TR</name>
          <addressOffset>0x100</addressOffset>
          <fields>
            <field>
              <name>TMODE</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>DBGSEL</name>
              <bitRange>[19:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DDR</name>
          <addressOffset>0x104</addressOffset>
          <fields>
            <field>
              <name>SHORTSW_DATA</name>
              <bitRange>[9:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
